package com.app.appsecond

import android.os.Parcelable
import kotlinx.parcelize.Parcelize

@Parcelize
data class Data(
    val id: Int,
    val way: String,
    var liked: Boolean,
    val time: List<Time>
) : Parcelable {
    companion object {
        fun initData() =
            arrayListOf(
                Data(
                    1,
                    "Москва — Симферополь",
                    false,
                    arrayListOf(
                        Time(
                            arrayListOf(
                                Station("Москва (Казанский вокзал)", "07:15"),
                                Station("Рязань-2", "10:09"),
                                Station("Мичуринск-Воронежский", "13:18"),
                                Station("Грязи-Воронежские", "14:05"),
                                Station("Придача (Воронеж-Южный)", "15:31"),
                                Station("Лиски", "16:45"),
                                Station("Россошь", "18:27"),
                                Station("Ростов-Главный", "00:04"),
                                Station("Тимашевская-1", "02:45"),
                                Station("Тамань-Пасс.", "06:52"),
                                Station("Керчь-Южная Новый Парк", "07:25"),
                                Station("Семь Колодезей", "08:24"),
                                Station("Владиславовка", "09:00"),
                                Station("Джанкой", "10:45"),
                                Station("Керчь-Южная Новый Парк", "07:25"),
                                Station("Симферополь-Пасс.", "12:00"),

                                ),
                            "07:15 — 12:00", "В пути 1 дн 5 ч"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Казанский вокзал)", "08:40"),
                                Station("Рязань-2", "11:06"),
                                Station("Мичуринск-Воронежский", "13:18"),
                                Station("Грязи-Воронежские", "14:05"),
                                Station("Придача (Воронеж-Южный)", "15:31"),
                                Station("Лиски", "16:45"),
                                Station("Россошь", "18:27"),
                                Station("Ростов-Главный", "00:04"),
                                Station("Тимашевская-1", "02:45"),
                                Station("Тамань-Пасс.", "06:52"),
                                Station("Керчь-Южная Новый Парк", "07:25"),
                                Station("Семь Колодезей", "08:24"),
                                Station("Владиславовка", "09:00"),
                                Station("Джанкой", "10:45"),
                                Station("Керчь-Южная Новый Парк", "07:25"),
                                Station("Симферополь-Пасс.", "12:00"),
                            ),
                            "08:40 — 12:00", "В пути 1 дн 3 ч"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Казанский вокзал)", "14:50"),
                                Station("Рязань-2", "17:47"),
                                Station("Мичуринск-Воронежский", "20:28"),
                                Station("Грязи-Воронежские", "21:22"),
                                Station("Отрожка", "22:46"),
                                Station("Придача (Воронеж-Южный)", "23:03"),
                                Station("Лиски", "00:03"),
                                Station("Россошь", "01:50"),
                                Station("Каменская", "04:58"),
                                Station("Лихая", "05:25"),
                                Station("Ростов-Главный", "07:57"),
                                Station("Тимашевская-1", "10:32"),
                                Station("Тамань-Пасс.", "14:42"),
                                Station("Керчь-Южная Новый Парк", "15:14"),
                                Station("Багерово", "15:33"),
                                Station("Чистополье", "15:50"),
                                Station("Семь Колодезей", "16:24"),
                                Station("Владиславовка", "16:57"),
                                Station("30 км", "18:00"),
                                Station("Джанкой", "19:20"),
                                Station("Симферополь-Пасс.", "20:48"),
                            ),
                            "14:50 — 20:48", "В пути 1 дн 6 ч"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Казанский вокзал)", "14:50"),
                                Station("Рязань-2", "17:32"),
                                Station("Мичуринск-Воронежский", "20:09"),
                                Station("Грязи-Воронежские", "21:05"),
                                Station("Отрожка", "22:43"),
                                Station("Придача (Воронеж-Южный)", "23:03"),
                                Station("Лиски", "00:03"),
                                Station("Россошь", "01:50"),
                                Station("Каменская", "04:58"),
                                Station("Лихая", "05:25"),
                                Station("Ростов-Главный", "07:57"),
                                Station("Тимашевская-1", "10:32"),
                                Station("Тамань-Пасс.", "14:42"),
                                Station("Керчь-Южная Новый Парк", "15:14"),
                                Station("Багерово", "15:33"),
                                Station("Чистополье", "15:50"),
                                Station("Семь Колодезей", "16:24"),
                                Station("Владиславовка", "18:10"),
                                Station("Новофедоровка", "18:46"),
                                Station("Нижнегорская", "19:27"),
                                Station("30 км", "19:49"),
                                Station("Джанкой", "20:42"),
                                Station("Симферополь-Пасс.", "22:00"),
                            ),
                            "14:50 — 22:00", "В пути 1 дн 7 ч"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Казанский вокзал)", "22:10"),
                                Station("Фаустово", "23:46"),
                                Station("Рязань-2", "01:39"),
                                Station("Мичуринск-Воронежский", "04:14"),
                                Station("Никольское", "04:42"),
                                Station("Грязи-Воронежские", "05:17"),
                                Station("Прибытково", "05:59"),
                                Station("Отрожка", "07:47"),
                                Station("Придача (Воронеж-Южный)", "08:07"),
                                Station("Масловка", "08:52"),
                                Station("Лиски", "09:59"),
                                Station("Евдаково", "11:09"),
                                Station("Россошь", "12:37"),
                                Station("Кутейниково", "14:39"),
                                Station("Миллерово", "15:43"),
                                Station("Тарасовка", "16:21"),
                                Station("Каменская", "17:20"),
                                Station("Лихая", "18:03"),
                                Station("Новочеркасск", "20:28"),
                                Station("Первомайская", "22:28"),
                                Station("Тимашевская-1", "01:41"),
                                Station("Протока", "03:03"),
                                Station("Тамань-Пасс.", "06:06"),
                                Station("Керчь-Южная Новый Парк", "06:35"),
                                Station("Чистополье", "07:10"),
                                Station("Пресноводная", "08:06"),
                                Station("Семь Колодезей", "08:40"),
                                Station("Петрово", "09:17"),
                                Station("Владиславовка", "09:40"),
                                Station("50 км", "10:34"),
                                Station("30 км", "10:58"),
                                Station("Джанкой", "12:20"),
                                Station("Симферополь-Пасс.", "13:45"),
                            ),
                            "22:10 — 13:45", "В пути 1 дн 16 ч"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Казанский вокзал)", "22:30"),
                                Station("Рязань-2", "01:17"),
                                Station("Мичуринск-Воронежский", "03:28"),
                                Station("Грязи-Воронежские", "04:12"),
                                Station("Отрожка", "05:29"),
                                Station("Придача (Воронеж-Южный)", "05:49"),
                                Station("Лиски", "07:09"),
                                Station("Подгорное", "08:54"),
                                Station("Россошь", "09:28"),
                                Station("Кутейниково", "11:51"),
                                Station("Миллерово", "12:45"),
                                Station("Каменская", "13:51"),
                                Station("Лихая", "14:23"),
                                Station("Предугольная", "14:58"),
                                Station("Новочеркасск", "16:33"),
                                Station("Первомайская", "18:05"),
                                Station("Придорожная", "20:14"),
                                Station("Тимашевская-1", "21:02"),
                                Station("Протока", "22:17"),
                                Station("Тамань-Пасс.", "01:18"),
                                Station("Керчь-Южная Новый Парк", "01:50"),
                                Station("Семь Колодезей", "03:01"),
                                Station("Владиславовка", "03:35"),
                                Station("Краснофлотская", "04:10"),
                                Station("Нижнегорская", "04:49"),
                                Station("Джанкой", "05:55"),
                                Station("Симферополь-Пасс.", "07:20"),
                            ),
                            "22:30 — 07:20", "В пути 1 дн 9 ч"
                        )
                    )
                ),
                Data(
                    2,
                    "Москва — Санкт-Петербург",
                    false,
                    arrayListOf(
                        Time(
                            arrayListOf(
                                Station("Москва (Ленинградский вокзал)", "02:08"),
                                Station("Торфяное", "09:05"),
                                Station("Рябово", "09:44"),
                                Station("Славянка", "10:37"),
                                Station("Санкт-Петербург (Ладож. вокзал)", "11:02")
                            ),
                            "02:08 — 11:02", "В пути 8 ч 54 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Ленинградский вокзал)", "02:20"),
                                Station("Редкино", "05:36"),
                                Station("Тверь", "06:03"),
                                Station("Спирово", "07:41"),
                                Station("Вышний Волочёк", "08:09"),
                                Station("Бологое", "09:10"),
                                Station("Малая Вишера", "10:50"),
                                Station("Санкт-Петербург (Ладож. вокзал)", "13:01")
                            ),
                            "02:20 — 13:01", "В пути 10 ч 41 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Ленинградский вокзал)", "05:35"),
                                Station("Редкино", "06:49"),
                                Station("Вышний Волочёк", "07:59"),
                                Station("Мстинский Мост", "09:36"),
                                Station("Санкт-Петербург (Ладож. вокзал)", "11:05")
                            ),
                            "05:35 — 11:05", "В пути 5 ч 30 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Ленинградский вокзал)", "05:55"),
                                Station("Санкт-Петербург (Ладож. вокзал)", "11:05")
                            ),
                            "05:55 — 09:35", "В пути 3 ч 40 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Ленинградский вокзал)", "06:00"),
                                Station("Мстинский Мост", "08:30"),
                                Station("Санкт-Петербург (Ладож. вокзал)", "09:44")
                            ),
                            "06:00 — 09:44", "В пути 3 ч 44 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Ленинградский вокзал)", "06:50"),
                                Station("Тверь", "07:56"),
                                Station("Бологое", "08:53"),
                                Station("Санкт-Петербург (Ладож. вокзал)", "10:45")
                            ),
                            "06:50 — 10:45", "В пути 3 ч 55 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Ленинградский вокзал)", "07:00"),
                                Station("Тверь", "08:04"),
                                Station("Вышний Волочёк", "08:47"),
                                Station("Угловка", "09:23"),
                                Station("Окуловка", "09:33"),
                                Station("Чудово-московское", "10:16"),
                                Station("Санкт-Петербург (Ладож. вокзал)", "11:04")
                            ),
                            "07:00 — 11:04", "В пути 4 ч 4 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Ленинградский вокзал)", "09:30"),
                                Station("Тверь", "10:34"),
                                Station("Окуловка", "11:50"),
                                Station("Санкт-Петербург (Ладож. вокзал)", "13:20")
                            ),
                            "09:30 — 13:20", "В пути 3 ч 50 мин"
                        )
                    )
                ),
                Data(
                    3,
                    "Москва — Анапа",
                    false,
                    arrayListOf(
                        Time(
                            arrayListOf(
                                Station("Москва (Казанский вокзал)", "10:40"),
                                Station("Рязань-2", "13:01"),
                                Station("Мичуринск-Воронежский", "15:14"),
                                Station("Грязи-Воронежские", "15:58"),
                                Station("Придача (Воронеж-Южный)", "17:26"),
                                Station("Лиски", "18:42"),
                                Station("Россошь", "20:26"),
                                Station("Ростов-Главный", "01:56"),
                                Station("Высочино", "02:38"),
                                Station("Каневская", "04:03"),
                                Station("Тимашевская-1", "04:57"),
                                Station("Полтавская", "05:56"),
                                Station("Анапа", "08:05")
                            ),
                            "10:40 — 08:05", "В пути 21 ч 25 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Казанский вокзал)", "11:00"),
                                Station("Рязань-2", "13:21"),
                                Station("Мичуринск-Воронежский", "15:45"),
                                Station("Грязи-Воронежские", "16:37"),
                                Station("Отрожка", "18:20"),
                                Station("Придача (Воронеж-Южный)", "18:40"),
                                Station("Лиски", "19:54"),
                                Station("Россошь", "21:52"),
                                Station("Лихая", "01:47"),
                                Station("Сулин", "02:35"),
                                Station("Шахтная", "03:05"),
                                Station("Новочеркасск", "03:45"),
                                Station("Ростов-Главный", "04:53"),
                                Station("Староминская-Тимаш.", "06:24"),
                                Station("Каневская", "07:05"),
                                Station("Брюховецкая", "07:38"),
                                Station("Тимашевская-1", "08:22"),
                                Station("Протока", "09:52"),
                                Station("9 км", "10:40"),
                                Station("Варениковская", "11:30"),
                                Station("Анапа", "12:20")
                            ),
                            "11:00 — 12:20", "В пути 1 дн 1 ч"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Киевский вокзал)", "16:52"),
                                Station("Калуга-1", "20:32"),
                                Station("Тула (Московский вокзал)", "23:10"),
                                Station("Мценск", "00:38"),
                                Station("Орёл", "01:54"),
                                Station("Курск", "03:57"),
                                Station("Щигры", "04:55"),
                                Station("Черемисиново", "05:20"),
                                Station("Кшень", "05:54"),
                                Station("Касторная-Курская", "06:40"),
                                Station("Нижнедевицк", "08:07"),
                                Station("Воронеж-1", "09:58"),
                                Station("Лиски", "11:46"),
                                Station("Россошь", "14:16"),
                                Station("Кутейниково", "16:20"),
                                Station("Миллерово", "17:15"),
                                Station("Каменская", "18:15"),
                                Station("Лихая", "19:00"),
                                Station("Сулин", "20:00"),
                                Station("Шахтная", "20:37"),
                                Station("Новочеркасск", "21:30"),
                                Station("Ростов-Главный", "22:53"),
                                Station("Староминская-Тимаш.", "00:20"),
                                Station("Каневская", "01:00"),
                                Station("Брюховецкая", "01:31"),
                                Station("Мышастовка", "02:57"),
                                Station("Краснодар-2", "03:41"),
                                Station("Краснодар-1", "04:10"),
                                Station("Ахтырская", "05:12"),
                                Station("Эриванский", "05:27"),
                                Station("Абинская", "05:42"),
                                Station("9 км", "06:30"),
                                Station("Анапа", "07:55"),
                            ),
                            "16:52 — 07:55", "В пути 1 дн 15 ч"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Киевский вокзал)", "21:30"),
                                Station("Калуга-1", "00:49"),
                                Station("Тула (Московский вокзал)", "03:49"),
                                Station("Мценск", "06:21"),
                                Station("Орёл", "08:43"),
                                Station("Курск", "09:44"),
                                Station("Щигры", "11:50"),
                                Station("Черемисиново", "14:10"),
                                Station("Кшень", "15:22"),
                                Station("Касторная-Курская", "17:35"),
                                Station("Нижнедевицк", "18:29"),
                                Station("Воронеж-1", "20:33"),
                                Station("Лиски", "21:23"),
                                Station("Россошь", "23:05"),
                                Station("Кутейниково", "23:57"),
                                Station("Миллерово", "00:52"),
                                Station("Каменская", "01:57"),
                                Station("Лихая", "02:25"),
                                Station("Сулин", "06:15"),
                                Station("Шахтная", "09:10"),
                                Station("Новочеркасск", "11:16"),
                                Station("Ростов-Главный", "12:20"),
                                Station("Анапа", "13:50"),
                            ),
                            "21:30 — 13:50", "В пути 1 дн 16 ч"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Киевский вокзал)", "21:50"),
                                Station("Рязань-2", "00:26"),
                                Station("Мичуринск-Воронежский", "01:31"),
                                Station("Грязи-Воронежские", "02:30"),
                                Station("Отрожка", "04:20"),
                                Station("Придача (Воронеж-Южный)", "06:25"),
                                Station("Лиски", "07:53"),
                                Station("Россошь", "10:20"),
                                Station("Лихая", "10:59"),
                                Station("Сулин", "11:20"),
                                Station("Шахтная", "12:35"),
                                Station("Новочеркасск", "14:22"),
                                Station("Ростов-Главный", "15:13"),
                                Station("Староминская-Тимаш.", "16:21"),
                                Station("Каневская", "17:02"),
                                Station("Брюховецкая", "20:02"),
                                Station("Тимашевская-1", "20:31"),
                                Station("Протока", "23:34"),
                                Station("9 км", "00:40"),
                                Station("Староминская-Тимаш.", "02:06"),
                                Station("Варениковская", "5:38"),
                                Station("Варениковская", "07:00"),
                                Station("Анапа", "07:15")
                            ),
                            "21:50 — 07:15", "В пути 1 дн 9 ч"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Киевский вокзал)", "23:30"),
                                Station("Рязань-2", "00:26"),
                                Station("Мичуринск-Воронежский", "01:31"),
                                Station("Грязи-Воронежские", "02:30"),
                                Station("Отрожка", "04:20"),
                                Station("Придача (Воронеж-Южный)", "06:25"),
                                Station("Лиски", "07:53"),
                                Station("Россошь", "10:20"),
                                Station("Лихая", "10:59"),
                                Station("Сулин", "11:20"),
                                Station("Шахтная", "12:35"),
                                Station("Новочеркасск", "14:22"),
                                Station("Ростов-Главный", "15:13"),
                                Station("Староминская-Тимаш.", "16:15"),
                                Station("Каневская", "17:02"),
                                Station("Брюховецкая", "20:02"),
                                Station("Тимашевская-1", "20:31"),
                                Station("Протока", "23:34"),
                                Station("9 км", "00:40"),
                                Station("Староминская-Тимаш.", "02:06"),
                                Station("Анапа", "5:58")
                            ),
                            "23:30 — 05:58", "В пути 1 дн 6 ч"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Киевский вокзал)", "23:40"),
                                Station("Рязань-2", "03:00"),
                                Station("Мичуринск-Воронежский", "04:27"),
                                Station("Грязи-Воронежские", "05:50"),
                                Station("Отрожка", "07:12"),
                                Station("Придача (Воронеж-Южный)", "07:44"),
                                Station("Лиски", "08:48"),
                                Station("Россошь", "11:22"),
                                Station("Лихая", "13:26"),
                                Station("Сулин", "14:50"),
                                Station("Нижнедевицк", "16:15"),
                                Station("Воронеж-1", "17:53"),
                                Station("Лиски", "18:31"),
                                Station("Россошь", "20:15"),
                                Station("Кутейниково", "22:15"),
                                Station("Миллерово", "00:12"),
                                Station("Каменская", "01:04"),
                                Station("Лихая", "01:58"),
                                Station("Сулин", "02:36"),
                                Station("Шахтная", "03:13"),
                                Station("Новочеркасск", "03:35"),
                                Station("Ростов-Главный", "04:05"),
                                Station("Староминская-Тимаш.", "05:24"),
                                Station("Каневская", "07:23"),
                                Station("Брюховецкая", "09:03"),
                                Station("Мышастовка", "10:02"),
                                Station("Краснодар-2", "10:24"),
                                Station("Краснодар-1", "12:23"),
                                Station("Ахтырская", "13:41"),
                                Station("Эриванский", "14:30"),
                                Station("Абинская", "15:37"),
                                Station("Анапа", "16:10")
                            ),
                            "23:40 — 16:10", "В пути 1 дн 17 ч"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Киевский вокзал)", "23:50"),
                                Station("Рязань-2", "00:26"),
                                Station("Мичуринск-Воронежский", "01:31"),
                                Station("Грязи-Воронежские", "02:30"),
                                Station("Отрожка", "04:20"),
                                Station("Придача (Воронеж-Южный)", "06:25"),
                                Station("Лиски", "07:53"),
                                Station("Россошь", "10:20"),
                                Station("Лихая", "10:59"),
                                Station("Сулин", "11:20"),
                                Station("Шахтная", "12:35"),
                                Station("Новочеркасск", "14:22"),
                                Station("Ростов-Главный", "15:13"),
                                Station("Староминская-Тимаш.", "16:15"),
                                Station("Каневская", "17:02"),
                                Station("Брюховецкая", "20:02"),
                                Station("Тимашевская-1", "20:31"),
                                Station("Протока", "23:34"),
                                Station("9 км", "00:40"),
                                Station("Староминская-Тимаш.", "02:06"),
                                Station("Анапа", "5:58")
                            ),
                            "23:50 — 05:58", "В пути 1 дн 6 ч"
                        )
                    )
                ),
                Data(
                    4,
                    "Москва — Нижний Новгород",
                    false,
                    arrayListOf(
                        Time(
                            arrayListOf(
                                Station("Москва (Восточный вокзал)", "06:32"),
                                Station("Владимир", "08:18"),
                                Station("Гороховец", "09:34"),
                                Station("Нижний Новгород", "10:16")
                            ),
                            "06:32 — 10:16", "В пути 3 ч 44 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Восточный вокзал)", "07:15"),
                                Station("Орехово-Зуево", "08:11"),
                                Station("Владимир", "09:00"),
                                Station("Ковров-1", "09:32"),
                                Station("Дзержинск", "10:40"),
                                Station("Нижний Новгород", "11:00")
                            ),
                            "07:15 — 11:00", "В пути 3 ч 45 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Восточный вокзал)", "10:35"),
                                Station("Владимир", "12:25"),
                                Station("Ковров-1", "12:56"),
                                Station("Дзержинск", "14:03"),
                                Station("Нижний Новгород", "14:25")
                            ),
                            "10:35 — 14:25", "В пути 3 ч 50 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Восточный вокзал)", "16:15"),
                                Station("Железнодорожная", "16:59"),
                                Station("Павловский Посад", "17:26"),
                                Station("Орехово-Зуево", "17:40"),
                                Station("Владимир", "18:29"),
                                Station("Ковров-1", "19:01"),
                                Station("Вязники", "19:30"),
                                Station("Гороховец", "19:56"),
                                Station("Дзержинск", "20:21"),
                                Station("Нижний Новгород", "20:43")
                            ),
                            "16:15 — 20:43", "В пути 4 ч 28 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Восточный вокзал)", "20:15"),
                                Station("Железнодорожная", "22:02"),
                                Station("Павловский Посад", "23:38"),
                                Station("Нижний Новгород (Моск. вокзал)", "23:59")
                            ),
                            "20:15 — 23:59", "В пути 3 ч 44 мин"
                        )
                    )
                ),
                Data(
                    5,
                    "Москва — Минск",
                    false,
                    arrayListOf(
                        Time(
                            arrayListOf(
                                Station("Москва (Белорусский вокзал)", "06:20"),
                                Station("Смоленск", "10:03"),
                                Station("Орша-Центр.(Беларусь)", "11:09"),
                                Station("Минск-Пасс.", "13:10")
                            ),
                            "06:20 — 13:10", "В пути 6 ч 15 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Белорусский вокзал)", "16:00"),
                                Station("Вязьма", "18:08"),
                                Station("Смоленск", "19:46"),
                                Station("Орша-Центр.(Беларусь)", "20:53"),
                                Station("Минск-Пасс.", "22:55")
                            ),
                            "16:00 — 22:55", "В пути 6 ч 55 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Белорусский вокзал)", "19:53"),
                                Station("Гагарин", "22:17"),
                                Station("Вязьма", "22:54"),
                                Station("Смоленск", "00:44"),
                                Station("Орша-Центр.(Беларусь)", "02:23"),
                                Station("Минск-Пасс.", "04:55")
                            ),
                            "19:53 — 04:55", "В пути 8 ч 48 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Белорусский вокзал)", "22:10"),
                                Station("Вязьма", "01:25"),
                                Station("Смоленск", "03:31"),
                                Station("Орша-Центр.(Беларусь)", "05:03"),
                                Station("Минск-Пасс.", "07:25")
                            ),
                            "22:10 — 07:25", "В пути 9 ч 15 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Белорусский вокзал)", "22:10"),
                                Station("Вязьма", "01:25"),
                                Station("Смоленск", "03:31"),
                                Station("Орша-Центр.(Беларусь)", "05:03"),
                                Station("Минск-Пасс.", "07:25")
                            ),
                            "22:17 — 06:31", "В пути 8 ч 14 мин"
                        )
                    )
                ),
                Data(
                    6,
                    "Москва — Ростов-на-Дону",
                    false,
                    arrayListOf(
                        Time(
                            arrayListOf(
                                Station("Москва (Казанский вокзал)", "00:30"),
                                Station("Рязань-2", "04:01"),
                                Station("Ряжск-1", "05:25"),
                                Station("Александро-Невская", "05:49"),
                                Station("Богоявленск", "06:11"),
                                Station("Мичуринск-Уральский", "07:33"),
                                Station("Грязи-Воронежские", "08:35"),
                                Station("Усмань", "09:16"),
                                Station("Придача", "10:20"),
                                Station("Лиски", "10:39"),
                                Station("Подгорное", "11:55"),
                                Station("Россошь", "13:39"),
                                Station("Кутейниково", "14:08"),
                                Station("Миллерово", "15:01"),
                                Station("Каменская", "16:52"),
                                Station("Лихая", "17:47"),
                                Station("Зверево", "19:00"),
                                Station("Сулин", "19:50"),
                                Station("Шахтная", "20:17"),
                                Station("Новочеркасск", "20:38"),
                                Station("Варениковская", "21:11"),
                                Station("Варениковская", "21:53"),
                                Station("Ростов-Главный", "22:49")
                            ),
                            "00:30 — 22:49", "В пути 22 ч 19 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Казанский вокзал)", "00:55"),
                                Station("Рязань-2", "03:08"),
                                Station("Ряжск-1", "06:01"),
                                Station("Александро-Невская", "06:48"),
                                Station("Богоявленск", "08:59"),
                                Station("Мичуринск-Уральский", "09:25"),
                                Station("Грязи-Воронежские", "09:50"),
                                Station("Усмань", "11:05"),
                                Station("Придача", "12:11"),
                                Station("Лиски", "14:04"),
                                Station("Подгорное", "14:25"),
                                Station("Россошь", "15:40"),
                                Station("Кутейниково", "18:06"),
                                Station("Миллерово", "19:31"),
                                Station("Каменская", "20:17"),
                                Station("Лихая", "21:16"),
                                Station("Зверево", "22:12"),
                                Station("Сулин", "22:59"),
                                Station("Шахтная", "23:34"),
                                Station("Новочеркасск", "00:24"),
                                Station("Варениковская", "01:03"),
                                Station("Варениковская", "01:43"),
                                Station("Ростов-Главный", "02:34")
                            ),
                            "00:55 — 02:34", "В пути 1 дн 2 ч"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Восточный вокзал)", "01:17"),
                                Station("Рязань-2", "03:08"),
                                Station("Ряжск-1", "06:01"),
                                Station("Александро-Невская", "06:48"),
                                Station("Богоявленск", "08:59"),
                                Station("Мичуринск-Уральский", "09:25"),
                                Station("Грязи-Воронежские", "09:50"),
                                Station("Усмань", "11:05"),
                                Station("Придача", "12:11"),
                                Station("Лиски", "14:04"),
                                Station("Подгорное", "14:25"),
                                Station("Россошь", "15:40"),
                                Station("Кутейниково", "18:06"),
                                Station("Миллерово", "19:31"),
                                Station("Каменская", "20:17"),
                                Station("Лихая", "22:17"),
                                Station("Зверево", "23:18"),
                                Station("Сулин", "00:13"),
                                Station("Шахтная", "01:22"),
                                Station("Новочеркасск", "01:44"),
                                Station("Варениковская", "02:14"),
                                Station("Варениковская", "03:05"),
                                Station("Ростов-Главный", "04:00")
                            ),
                            "01:17 — 04:00", "В пути 1 дн 3 ч"
                        )
                    )
                ),
                Data(
                    7,
                    "Москва — Сочи",
                    false,
                    arrayListOf(
                        Time(
                            arrayListOf(
                                Station("Москва (Киевский вокзал)", "00:55"),
                                Station("Калуга-1", "03:08"),
                                Station("Тула (Московский вокзал)", "04:37"),
                                Station("Мценск", "06:01"),
                                Station("Орёл", "06:30"),
                                Station("Курск", "06:48"),
                                Station("Щигры", "07:10"),
                                Station("Черемисиново", "07:23"),
                                Station("Кшень", "07:36"),
                                Station("Касторная-Курская", "08:10"),
                                Station("Нижнедевицк", "08:39"),
                                Station("Воронеж-1", "08:59"),
                                Station("Лиски", "09:25"),
                                Station("Россошь", "09:50"),
                                Station("Кутейниково", "11:05"),
                                Station("Миллерово", "12:11"),
                                Station("Каменская", "14:04"),
                                Station("Лихая", "14:25"),
                                Station("Сулин", "15:40"),
                                Station("Шахтная", "18:06"),
                                Station("Новочеркасск", "20:17"),
                                Station("Ростов-Главный", "21:16"),
                                Station("Староминская-Тимаш.", "22:12"),
                                Station("Каневская", "22:59"),
                                Station("Брюховецкая", "23:34"),
                                Station("Мышастовка", "00:24"),
                                Station("Энем-2", "01:03"),
                                Station("Саратовская", "02:52"),
                                Station("Краснодар-1", "05:13"),
                                Station("Горячий Ключ", "07:31"),
                                Station("Краснодар-2", "10:30"),
                                Station("Фанагорийская", "12:53"),
                                Station("Ахтырская", "13:29"),
                                Station("Эриванский", "14:00"),
                                Station("Абинская", "14:20"),
                                Station("9 км", "14:31"),
                                Station("Сочи", "14:52")
                            ),
                            "00:55 — 14:52", "В пути 1 дн 14 ч"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Казанский вокзал)", "10:50"),
                                Station("Рязань-2", "13:11"),
                                Station("Мичуринск-Воронежский", "15:30"),
                                Station("Грязи-Воронежские", "16:13"),
                                Station("Отрожка", "17:34"),
                                Station("Придача", "17:54"),
                                Station("Лиски", "18:58"),
                                Station("Россошь", "20:36"),
                                Station("Ростов-Главный", "02:06"),
                                Station("Краснодар-1", "05:17"),
                                Station("Горячий Ключ", "06:34"),
                                Station("Туапсе-Пасс.", "08:00"),
                                Station("Лазаревская", "08:44"),
                                Station("Сочи", "09:46")
                            ),
                            "10:50 — 09:46", "В пути 22 ч 56 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Казанский вокзал)", "14:40"),
                                Station("Рязань-2", "17:22"),
                                Station("Мичуринск-Воронежский", "19:40"),
                                Station("Грязи-Воронежские", "20:25"),
                                Station("Отрожка", "21:47"),
                                Station("Придача", "22:57"),
                                Station("Лиски", "00:35"),
                                Station("Россошь", "06:11"),
                                Station("Ростов-Главный", "11:32"),
                                Station("Горячий Ключ", "12:16"),
                                Station("Туапсе-Пасс.", "12:30"),
                                Station("Лазаревская", "13:45"),
                                Station("Сочи", "13:18")
                            ),
                            "14:40 — 13:18", "В пути 22 ч 38 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Казанский вокзал)", "15:20"),
                                Station("Рязань-2", "17:22"),
                                Station("Мичуринск-Воронежский", "19:40"),
                                Station("Грязи-Воронежские", "20:25"),
                                Station("Отрожка", "21:47"),
                                Station("Придача", "22:57"),
                                Station("Лиски", "00:35"),
                                Station("Россошь", "06:11"),
                                Station("Ростов-Главный", "12:32"),
                                Station("Горячий Ключ", "13:16"),
                                Station("Туапсе-Пасс.", "14:30"),
                                Station("Лазаревская", "14:45"),
                                Station("Сочи", "16:20")
                            ),
                            "15:20 — 16:20", "В пути 1 д 1 ч"
                        )
                    )
                ),
                Data(
                    8,
                    "Москва — Ярославль",
                    false,
                    arrayListOf(
                        Time(
                            arrayListOf(
                                Station("Москва (Ярослав. вокзал)", "06:25"),
                                Station("Ростов-Ярославский", "08:46"),
                                Station("Ярославль-Главный", "09:24")
                            ),
                            "06:25 — 09:24", "В пути 2 ч 59 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Ярослав. вокзал)", "10:05"),
                                Station("Александров-1", "11:55"),
                                Station("Ростов-Ярославский", "13:39"),
                                Station("Ярославль-Главный", "14:43")
                            ),
                            "10:05 — 14:43", "В пути 4 ч 38 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Ярослав. вокзал)", "12:50"),
                                Station("Александров-1", "14:43"),
                                Station("Ростов-Ярославский", "15:58"),
                                Station("Ярославль-Главный", "17:06")
                            ),
                            "12:50 — 17:06", "В пути 4 ч 16 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Ярослав. вокзал)", "13:05"),
                                Station("Александров-1", "14:57"),
                                Station("Ростов-Ярославский", "16:16"),
                                Station("Ярославль-Главный", "17:02")
                            ),
                            "13:05 — 17:02", "В пути 3 ч 57 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Ярослав. вокзал)", "15:00"),
                                Station("Ростов-Ярославский", "18:08"),
                                Station("Ярославль-Главный", "19:10")
                            ),
                            "15:00 — 19:10", "В пути 4 ч 10 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Ярослав. вокзал)", "18:45"),
                                Station("Сергиев Посад", "19:46"),
                                Station("Берендеево", "14:57"),
                                Station("Ростов-Ярославский", "21:32"),
                                Station("Ярославль-Главный", "22:31")
                            ),
                            "18:45 — 22:31", "В пути 3 ч 46 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Ярослав. вокзал)", "23:20"),
                                Station("Ростов-Ярославский", "02:26"),
                                Station("Ярославль-Главный", "03:13")
                            ),
                            "23:20 — 03:13", "В пути 3 ч 53 мин"
                        )
                    )
                ),
                Data(
                    9,
                    "Москва — Казань",
                    false,
                    arrayListOf(
                        Time(
                            arrayListOf(
                                Station("Москва (Казан. вокзал)", "13:10"),
                                Station("Муром-1", "16:34"),
                                Station("Навашино", "17:51"),
                                Station("Арзамас-2", "18:09"),
                                Station("Бобыльская", "19:43"),
                                Station("Сергач", "20:12"),
                                Station("Пильна", "22:03"),
                                Station("Шумерля", "23:28"),
                                Station("Казань-Пасс.", "02:05")
                            ),
                            "13:10 — 02:05", "В пути 12 ч 55 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Казан. вокзал)", "16:38"),
                                Station("Муром-1", "21:09"),
                                Station("Сергач", "00:43"),
                                Station("Канаш-1", "02:58"),
                                Station("Казань-Пасс.", "05:03")
                            ),
                            "16:38 — 05:03", "В пути 12 ч 25 ч"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Казан. вокзал)", "17:38"),
                                Station("Вековка", "21:12"),
                                Station("Муром-1", "22:40"),
                                Station("Канаш-1", "03:24"),
                                Station("Казань-2", "05:18")
                            ),
                            "17:38 — 05:18", "В пути 11 ч 40 ч"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Казан. вокзал)", "20:50"),
                                Station("Вековка", "23:39"),
                                Station("Сергач", "01:05"),
                                Station("Канаш-1", "05:47"),
                                Station("Казань-Пасс.", "05:03")
                            ),
                            "20:50 — 08:00", "В пути 11 ч 10 мин"
                        ),
                        Time(
                            arrayListOf(
                                Station("Москва (Казан. вокзал)", "23:59"),
                                Station("Вековка", "03:47"),
                                Station("Муром-1", "04:46"),
                                Station("Навашино", "05:04"),
                                Station("Арзамас-2", "06:26"),
                                Station("Бобыльская", "06:55"),
                                Station("Смагино", "07:37"),
                                Station("Сергач", "08:15"),
                                Station("Шумерля", "09:08"),
                                Station("Канаш-1", "10:31"),
                                Station("Урмары", "11:09"),
                                Station("Зелёный Дол", "11:57"),
                                Station("Казань-Пасс.", "12:54")
                            ),
                            "20:50 — 12:54", "В пути 12 ч 55 мин"
                        )
                    )
                )
            )

    }
}

@Parcelize
data class Time(
    val stations: List<Station>,
    val time: String,
    val time_way: String
) : Parcelable

@Parcelize
data class Station(
    val station: String,
    val time: String
) : Parcelable